## Plans :thumbsup:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/64340904/runs/5050cea9-73f1-4891-a21c-86a538d07a9e).

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>


## Dir: . | Success :thumbsup:
**Dir**: .
**Workspace**: default
**Success**: :thumbsup:

**Step**: plan
**Success**: :thumbsup:
**Command**: `terraform plan -detailed-exitcode -out /tmp/tmpokwfvt5i/plan`
```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_api_gateway_deployment.mock_api will be created
+   resource "aws_api_gateway_deployment" "mock_api" {
+       created_date  = (known after apply)
+       execution_arn = (known after apply)
+       id            = (known after apply)
+       invoke_url    = (known after apply)
+       rest_api_id   = "5fa7xm30gb"
+       stage_name    = "test"
    }

  # aws_api_gateway_integration_response.weather_integration_response will be created
+   resource "aws_api_gateway_integration_response" "weather_integration_response" {
+       http_method        = "GET"
+       id                 = (known after apply)
+       resource_id        = "lkzyz8"
+       response_templates = {
+           "application/json" = jsonencode(
                {
+                   forecast     = "Sunny"
+                   mock_message = "Mock API response for testing"
+                   temperature  = "22C"
                }
            )
        }
+       rest_api_id        = "5fa7xm30gb"
+       status_code        = "200"
    }

  # aws_lambda_function.mock_api_lambda will be created
+   resource "aws_lambda_function" "mock_api_lambda" {
+       architectures                  = (known after apply)
+       arn                            = (known after apply)
+       code_sha256                    = (known after apply)
+       description                    = "Lambda to call mock API with Doppler secret"
+       filename                       = "lambda_function.zip"
+       function_name                  = "mock-api-test-function"
+       handler                        = "lambda_function.lambda_handler"
+       id                             = (known after apply)
+       invoke_arn                     = (known after apply)
+       last_modified                  = (known after apply)
+       memory_size                    = 128
+       package_type                   = "Zip"
+       publish                        = false
+       qualified_arn                  = (known after apply)
+       qualified_invoke_arn           = (known after apply)
+       reserved_concurrent_executions = -1
+       role                           = "arn:aws:iam::***:role/lambda-execution-role"
+       runtime                        = "python3.9"
+       signing_job_arn                = (known after apply)
+       signing_profile_version_arn    = (known after apply)
+       skip_destroy                   = false
+       source_code_hash               = "ZpV5qe+dW6ETxV/8sBIb4bcICOnahSfDYdG06nOifCw="
+       source_code_size               = (known after apply)
+       tags_all                       = (known after apply)
+       timeout                        = 10
+       version                        = (known after apply)

+       environment {
+           variables = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   lambda_function_arn = (known after apply)
+   mock_api_url        = (known after apply)

```

</details>

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| . | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
